perftests/smol-run1.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0012 secs
  Slowest:	0.1613 secs
  Fastest:	0.0000 secs
  Average:	0.0060 secs
  Requests/sec:	65754.6579
  
  Total data:	74961992 bytes
  Size/request:	74 bytes

Response time histogram:
  0.000 [1]	|
  0.016 [963689]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [33230]	|■
  0.048 [2377]	|
  0.065 [412]	|
  0.081 [74]	|
  0.097 [13]	|
  0.113 [4]	|
  0.129 [187]	|
  0.145 [8]	|
  0.161 [5]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0015 secs
  50% in 0.0021 secs
  75% in 0.0035 secs
  90% in 0.0083 secs
  95% in 0.0136 secs
  99% in 0.0241 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1613 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0059 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0303 secs
  resp wait:	0.0055 secs, 0.0000 secs, 0.1612 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0561 secs

Status code distribution:
  [200]	1000000 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59338->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59342->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59343->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59345->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59346->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59347->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59348->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59349->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59351->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59432->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59433->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59439->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59440->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59441->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59443->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59457->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59460->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59461->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59462->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59463->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59464->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59465->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59466->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59467->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59468->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59469->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59470->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59471->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59472->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59473->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59474->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59475->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:59476->127.0.0.1:9000: read: connection reset by peer